# TransmissionData Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TransmissionData Properties
TransmissionData Class See Also
---
The TransmissionData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsTransmitted | Determines whether this file has been transmitted or not. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| UserData | A string which users can store notes in. |
| Version | The format version for TransmissionData |

# See Also
TransmissionData Class
Autodesk.Revit.DB Namespace